#include <stdio.h>
#include "cmsis_os2.h"                  /* ::CMSIS:RTOS2 */
#include "RTE_Components.h"             /* Component selection */
#include "Task.h"
#include "S32K144.h"
#include "S32K144_API.h"
#include "SystemConfig.h"
#include "function.h"
#include "s32_core_cm4.h"
#include  "Bms-Input-Output-Port.h"
/*-------------------------------------------------------------------------------------------------------------------------------
*                                                      ÈÎÎñ5Ïß³Ì:
*ËµÃ÷:ÈÎÎñ5ÓÃÀ´Íê³ÉËùÓëUDSÏà¹ØµÄ¹¦ÄÜ£º
*-------------------------------------------------------------------------------------------------------------------------------*/
void Task5(void *argument) 
{

	(void)argument;
      /*=============================================±äÁ¿³õÊ¼»¯================================================*/
      /*=======================================================================================================*/      
	for (;;) 
	{
            #if   SYSTEM_DUTY_ENABLE==1                 /*ÆôÓÃLS3²âÁ¿ÏµÍ³¹¤×÷Ð§ÂÊ*/
                  LS3_DISABLE;            /*µÍ¶Ë¿ª¹Ø3½ûÖ¹,PTD17=0*/  /*²âÁ¿ÏµÍ³¹¤×÷¸ºÔØÂÊ*/
            #endif
		osDelay(TICK_1000mS);	/*1SÊ±¼äÆ¬*/
            #if   SYSTEM_DUTY_ENABLE==1                 /*ÆôÓÃLS3²âÁ¿ÏµÍ³¹¤×÷Ð§ÂÊ*/
                  LS3_ENABLE;       /*µÍ¶Ë¿ª¹Ø3Ê¹ÄÜ,PTD17=1*/ /*²âÁ¿ÏµÍ³¹¤×÷¸ºÔØÂÊ*/
            #endif
            /*================================ÔÚ±¾´¦Ìí¼ÓÐèÒªµÄ¿ØÖÆº¯Êý===================================*/
		/*===========================================================================================*/
	}
}
